####################### 1) 변수 사용하기

# 삼성전자라는 변수로 50,000원을 바인딩해보세요. 삼성전자 주식 10주를 보유하고 있을 때 총 평가금액을 출력하세요.

삼성전자 = 50000
총평가금액 = 삼성전자 * 10
print(총평가금액)


####################### 2) 다음 표는 삼성전자의 일부 투자정보입니다. 변수를 사용해서 시가총액, 현재가, PER 등을 바인딩해보세요.

# 항목	|   값
# 시가총액	|   298조
# 현재가	|   50, 000원
# PER	 |   15.79

시가총액 = 298000000000000
현재가 = 5000
PER = 15.79
print(시가총액)
print(현재가)
print(PER)

####################### 3) 문자열 출력
# 변수 s와 t에는 각각 문자열이 바인딩 되어있습니다.

# >> s = "hello"
# >> t = "python"
# 두 변수를 이용하여 아래와 같이 출력해보세요.

# 실행 예:
# hello! python

s = "hello"
t = "python"
print(s+"!", t)
