# 백설공주는 ...... 일곱난쟁이의 키의 합이 100인걸 알아냈다. 백설공주를 도와 일곱 난쟁이를 찾는 프로그램을 작성해보시오.
# 입력 : 아홉 개의 줄에 걸쳐 난쟁이들의 키가 주어진다. 주어지는 키는 100을 넘지 않는 자연수이며, 아홉 난쟁이의 키는 모두 다르며, 가능한 정답이 여러 가지인 경우에는 아무거나 출력한다.
# 출력 : 일곱 난쟁이의 키를 오름차순으로 출력한다. 일곱 난쟁이를 찾을 수 없는 경우는 없다.

n = list(input() for i in range(9))
sums = 0
#숫자 하나를 지정하고 그 값애 다른 숫자들을 100이 나올때까지 정해서 100이 나오지않으면 패스. 100이 나오면 리스트에 저장

#n = [20,7,23,19,10,15,25,8,13]

for i in range(len(n)): #9
    sums = sums + n[i] #20
    if sums > 100:
        sums = 0
        
        
        

